package com.geek.infoandroid.android.Level2.les8.addPlayMarket;

public class comment {
    /*
    примерно с 1:50 8 урок власкин
    1) зайти в консоль разработчика(в гугле ввести просто)   и зарегестрироваться
    2) мы получили доступ к гугл плей консоли(черещ эту консоль публикуем наше приложение)
    она позволяет создавать разные версии(например рабочая- которая улетит нашим пользователям)
    (альфа версии,бетта версии- для тестирования отдельными группами тестеров(50 - 100 человек например ) в общем выбираем лиц ,которым будет доступно скачивание)
    3)нажимаем создать приложение и выбираем там параметры приложения(платная, бесплатная)
    4)дальше открываестся черновик в котором указываем разные параметры,возрастные ограничения,в каких странах будет доступно,целевая аудитория и тд
    5)после того как заполнили,появляется кнопочка опубликовать и публикуем
    публикуется в течении какого-то времени(пока не пройдет проверку гугла на вирусы и контент)


  Разместить можно как---    (Build-Generate Signed Bundle/APK)cгенерировать подписанный апк файл
    1)APK file - содержит вью информацию о нашем приложении в одном файле,все языки,ресурсы и тд...(апк это зип)(если 1 язык и одна конфигурация можно не заморачиваться и создать апк
    2)APP Bundle - позволяет для каждого устройства создать свой конкретный файл , с нужным языком  и остальными конфигурациями(более современное решение)
    3) заполняем остальные данные 2:05- 2:15

   Версианирование
    1)в бандле в DefaultConfig{..} есть versionCode 1
    2) когда выкладываем впервые ,он стоит 1,если выкладываем обновленную версию,потребудется поставить 2
    3)пользователь не видит VersionCode , он видит VersionName "1.0.0"


*/}

