package com.geek.infoandroid.Level3libraries.Patterns.Clean;

public class CommentsCleanLukovayaSistema {
    /*1 это нижний слой ,4 самый наружний
    1)Entities - это бизнес логика(интерфейсы ,дата классы и тд)если на примере банковского приложения -это деньги(сами единицы как дан)
    2)use cases - это логика приложения(например логика конвертивования валюты из рублей в доллары будет находиться в этом слое)
    3)интерфейсАдаптеры(controllers ,Presenters)- слой в котором находится вью модель и активити или фрагмент
    4)Frameworks - базы данных, запросы в сеть ,ретрофит и тд







    * */
}
