package com.geek.infoandroid.android.LayoutsAndOtladka;

public class OsnovnoePoKommandam {
/*
    Ctrl+Backspace  — удалить от текущей позиции до начала слова.
    Ctrl+Delete  — удалить от текущей позиции до конца слова.
    Ctrl+Y  — удалить строку.
    Ctrl+Q — показать документацию по API.
    Ctrl+[ — перейти в начало блока.
    Ctrl+] — перейти в конец блока.
    Ctrl+Alt+O — оптимизировать секцию import в файле.
    Ctrl+Alt+L — переформатировать код.
    Ctrl+Space — подсказка по завершению кода.
    Ctrl+Shift+Space — умное завершение кода.
    Ctrl+Alt+T — обернуть выделенный код в блок, вариантов много: if, while, for, try/catch…
    Ctrl+Shift+↑, Ctrl+Shift+↓ — передвинуть строчку вверх/вниз внутри метода, передвинуть метод вверх/вниз внутри класса.
    Ctrl+Alt+M — вытащить выделенные строки в отдельный метод.
    Ctrl+Alt+F — вытащить переменную в поле класса.
    Ctrl+P — показать параметры метода.
    Ctrl+Shift+Z — вернуть отмену ctrl + z


    F8 — шаг выполнения в режиме отладки.
    F7 — шаг внутрь метода в режиме отладки.
    Shift+F8 — выйти из метода в режиме отладки..

*/

}
