package com.geek.infoandroid.android.LayoutsAndOtladka;

public class StudioCommands {

/*
    Ctrl+X, Ctrl+C, Ctrl+V, Ctrl+Insert, Shift+Insert — работа с буфером обмена.
    Shift+↓, Shift+↑, Shift+→, Shift+←, Ctrl+Shift+←, Ctrl+Shift+→ — выделение текста.
*/
/*

Ctrl+Q — показать документацию по API.
    Ctrl+LeftButton — перейти к объявлению сущности.//зайти в метод и посмотреть его суть
   ... Alt+F7 — посмотреть использование сущности, будь то переменная, или имя класса, или метод...
    Ctrl+Z — отменить последнее действие.
    Ctrl+[ — перейти в начало блока.
    Ctrl+] — перейти в конец блока.
    Ctrl+/ — закомментировать строку (или выделенный фрагмент текста).
    Ctrl+Shift+/ — закомментировать выделенный фрагмент текста.
    Ctrl+Alt+O — оптимизировать секцию import в файле.
    Tab — сделать отступ строке или выделенным строкам.
    Shift+Tab — сделать отступ назад строке или выделенным строкам.
    F5 — копировать класс.
    Alt+Enter — быстрый фикс ошибок.
    Ctrl+Space — подсказка по завершению кода.

    Ctrl+Shift+Space — умное завершение кода.
    Ctrl+F — поиск.
    F3  — следующий поиск.
    Ctrl+Shift+F — поиск по проекту.
    Ctrl+Tab — переход по окнам.
    Ctrl+Alt+T — обернуть выделенный код в блок, вариантов много: if, while, for, try/catch…
    Ctrl+S — сохранить все файлы.
    Shift+F6 — переименовать.
    Ctrl+F6 —изменить сигнатуру.
    Ctrl+Shift+↑, Ctrl+Shift+↓ — передвинуть строчку вверх/вниз внутри метода, передвинуть метод вверх/вниз внутри класса.
    Ctrl+Alt+M — вытащить выделенные строки в отдельный метод.


    Ctrl+Alt+F — вытащить переменную в поле класса.
Ctrl+Alt+P — вытащить переменную в параметр метода.
Ctrl+Alt+C — вытащить значение в константу.
Ctrl+H — посмотреть иерархию классов.

Ctrl+Shift+Backspace — перейти к последнему месту редактирования.
Ctrl+Y  — удалить строку.
Ctrl+Backspace  — удалить от текущей позиции до начала слова.
Ctrl+Delete  — удалить от текущей позиции до конца слова.
Ctrl+F4 — закрыть текущее окно.
Ctrl+U — открыть базовый класс.

Ctrl+P — показать параметры метода.
Ctrl+Alt+L — переформатировать код.
Alt+Insert  — создать быстро конструктор или сет гет и тд....
Ctrl+Shift+Z — вернуть отмену.
Ctrl+O — переопределить методы.

Ctrl+I — реализовать методы интерфейса.

Ctrl+Plus — развернуть свернутый метод.
Ctrl+Minus — свернуть метод.
Ctrl+Shift+Plus — развернуть все свернутые методы.
Ctrl+Shift+Minus — свернуть все методы.
Ctrl+G (для MAC — Command+L) — перейти на номер строки.

Ctrl+F9 — построить проект.
Shift+F10 (для MAC — Control+R) — запустить приложение.
Shift+F9 — запустить приложение с отладчиком.


///ЭТО ДЛЯ ОТЛАДКИ
Ctrl+F8 — поставить точку останова для отладчика.
Ctrl+Alt+Shift+F8 — поставить одноразовую точку останова.
Ctrl+Shift+F8 — показать все точки останова.
F8 — шаг выполнения в режиме отладки.
F7 — шаг внутрь метода в режиме отладки.
Shift+F8 — выйти из метода в режиме отладки.
Alt+F9 — выполнить программный код до курсора.
F9  — выполнять программу в режиме отладки.
*/

}
