package com.example.gitt.moxy

class Stategy {/*
    AddToEndStrategy — добавит пришедшую команду в конец очереди (используется по умолчанию).
    AddToEndSingleStrategy — добавит пришедшую команду в конец очереди команд. Если команда такого
    типа уже есть в очереди, то действующая удалится. В большинстве случаев подходит именно эта стратегия.

    SingleStateStrategy — очистит всю очередь команд, после чего добавит в неё себя.
    OneExecutionStateStrategy — команда добавится в очередь и удалится после первого выполнения.
    SkipStrategy — команда не добавится в очередь и никак её (очередь) не изменит.*/
}