package com.geek.infoandroid.Fragments5;

public class LIFECYCLEFragment {
    /*onAttach( )//прикрепляет фрагмент к активити и получает ссылку на активити в этом методе
   onCreate()//вызывается при создании
   onCreateView() //здесь создаем вью в котором будет содержимое фрагмента и отдаем его системе
   onViewCreated() //получаем вью для инициализации вьюх
   onActivityCreated()//вызывается после того как актвити вызвало метод onCreate()  дает понять фрагменту что активити создано
   onStart();//вызывается до того как на экране что-то покажется(используется для подписок на какие-нибудь эвенты)
   onResume();после того как на экране что-то покажется

   onPause();вызывается перед тем как на экране что-то исчезнет или когда экран что-то частично перекрыло(например диалог фрагмент)
   onStop();либо когда свернули,либо когда ушли в другую активити или фрагмент закрыли
   onDestroyView();//вью которое мы создавали в методе onCreateView() уничтожено и более не доступно
   onDestroy();//вызывается когда выкидываем фрагмент из бэкстека или когда полностью сворачиваем приложение
   onDetach();//фрагмент удален с активити(отсоединен)

   onSaveInstanceState() //для сохранения данных при пересоздании фрагмента
   прочесть можно из Bundle в методах onCreate,onCreateView,onActivityCreated()(там он является входящим аргументом
   //saveInstanceState.getInt("ключ",0);//получить значение из бандла
   */
}
